#include <stdio.h>
#include <stdlib.h>

//Да се напише програма, която прочита от клавиатурата две цели числа и извежда сумата на числата между тези две числа.
//Въведените числа от клавиатурата не е задължително да са в ред по-малко, по-голямо.

//Вход: 2 7

//Изход: 18 Обяснение 3+4+5+6 = 18


int main(){
    int a, b;
    int sum = 0;
    scanf("%d %d", &a, &b);

if (a>b){
    for (int i=a-1; i>b; i--){
        sum = sum + i;
    }
}

if (a<b){
   for (int i=a+1; i<b; i++){
       sum += i;
    }
}
printf("Sum is %d", sum);
return 0;
}
