#include <stdio.h>
#include <stdlib.h>

//6.Напишете програма, която проверява дали точка {x, y} се намира вътре
//в правоъгълник {x1, y1} – {x2, y2}. Входните данни се четат от
//конзолата и се състоят от 6 реда, въведени от потребителя: десетичните
//числа x1, y1, x2, y2, x и y (като се гарантира, че x1 < x2 и y1 < y2). Една
//точка е вътрешна за даден правоъгълник, ако се намира някъде във
//вътрешността му или върху някоя от страните му. Отпечатайте “Inside”
//или “Outside”.


int main()
{
    int x1, x2, y1, y2, x, y;
    printf("x1 = ");
    scanf("%d", &x1);
    printf("y1 = ");
    scanf("%d", &y1);
    printf("x2 = ");
    scanf("%d", &x2);
    printf("y2 = ");
    scanf("%d", &y2);
    printf("x = ");
    scanf("%d", &x);
    printf("y = ");
    scanf("%d", &y);


    if (x>x1 && x<x2 && y>y1 && y<y2)
    {
        printf("Inside");
    }
    else
    {
        printf("Outside");
    }

    return 0;
}
