#include <stdio.h>
#include <stdlib.h>

//4.Дадено е цяло число – брой точки. Върху него се начисляват бонус
//точки по правилата, описани по-долу. Да се напише програма, която
//пресмята бонус точките за това число и общия брой точки с бонусите.
//● Ако числото е до 100 включително, бонус точките са 5.
//● Ако числото е по-голямо от 100, бонус точките са 20% от числото.
//● Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
//● Допълнителни бонус точки (начисляват се отделно от предходните):
//o За четно число  + 1 т.
//o За число, което завършва на 5  + 2 т.

//Примери:
//вход     изход              вход    изход                вход      изход
//20        6                 175       37                 2703       270.3
          //26                         212                            2973.3

int main()
{
    int n;
    int bonus;
    int total;
    printf("Enter number of points: ");
    scanf("%d", &n);
    if (n>0 && n<=100) {
        bonus = 5;
        total = n + bonus;
    }
    else if (n>100 && n<=1000) {
        bonus = n * 20/100;
        total = n + bonus;
    }
    else if (n>1000) {
        bonus = n * 0.1;
        total = n + bonus;
    }

    if (n%2==0) {
        bonus += 1;
        total += 1;
    }

    else if (n%5==0 && n%10!=0) {
        bonus += 2;
        total += 2;
    }

    printf("Bonus: %d\nTotal: %d", bonus, total);

    return 0;
}

